# Field Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Field Properties
Field Class See Also
---
The Field type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ContainerType | Reports whether this is a simple field containing one value, or a container of multiple values. |
| Documentation | The overall description of the Field. |
| FieldName | The name of the field. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| KeyType | The type of the keys stored in the field. |
| Schema | The Schema to which this Field belongs. |
| SubSchema | The Schema describing the subentity (or subentities) stored in this Field. |
| SubSchemaGUID | The GUID of the Schema describing the subentity (or subentities) stored in this Field. |
| ValueType | The type of the values stored in the field. |

# See Also
Field Class
Autodesk.Revit.DB.ExtensibleStorage Namespace